app/controllers/drivers_controller.rb

  def show
    @driver = Driver.find(params[:id])
    @ride_review = RideReview.new
    if current_user
      @user = User.find(session[:user_id])
---
SELECT  "drivers".* FROM "drivers"  WHERE "drivers"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 11]]

  def search
    @driver = Driver.find_by(:medallion_number => params[:medallion_number])
---
SELECT  "drivers".* FROM "drivers"  WHERE "drivers"."medallion_number" = '1A10' LIMIT 1