app/controllers/ride_reviews_controller.rb

  def create
    @user = User.find(session[:user_id])
    @driver = Driver.find(params[:ride_review][:driver_id])
    @ride_review = @user.ride_reviews.create(ride_review_params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 11]]
SELECT  "drivers".* FROM "drivers"  WHERE "drivers"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "ride_reviews" ("comments", "created_at", "driver_id", "star_rating", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["comments", ""], ["created_at", "2014-11-22 19:52:37.334505"], ["driver_id", 2], ["star_rating", 3], ["updated_at", "2014-11-22 19:52:37.334505"], ["user_id", 11]]