app/views/drivers/show.html.erb


  <% if @driver.ride_reviews.size == 0 %>
---
SELECT "ride_reviews".* FROM "ride_reviews"  WHERE "ride_reviews"."driver_id" = ?  [["driver_id", 2]]
SELECT COUNT(*) FROM "ride_reviews"  WHERE "ride_reviews"."driver_id" = ?  [["driver_id", 2]]

                    <a href="<%= user_path(rev.user_id) %>"><%= rev.user.name %></a><br>
                    <span class="glyphicon glyphicon-pencil"><p><%= pluralize(rev.user.ride_reviews.count, 'review') %></p></span>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 11]]